#__author__ = Zdorov Ilya

# Реализовать функцию, принимающую два числа (позиционные аргументы) и 
# выполняющую их деление. Числа запрашивать у пользователя, предусмотреть 
<<<<<<< HEAD
# обработку ситуации деления на ноль.

def func():
    s_1 = int(input("Enter num_1: "))
    s_2 = int(input("Enter num_2: "))
    s_3 = s_1 / s_2
   # except Exception as s_3: как включить исключение(
    if s_2 != 0:
        print("%.2f" % (s_1 / s_2))
    else:
        print("Деление на ноль!")
func()
=======
# обработку ситуации деления на ноль.
>>>>>>> master
